virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/component/aic.h
/*
 * Component description for AIC
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T09:00:02Z */
#ifndef _SAMA5D2_AIC_COMPONENT_H_
#define _SAMA5D2_AIC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR AIC                                          */
/* ************************************************************************** */

/* -------- AIC_SSR : (AIC Offset: 0x00) (R/W 32) Source Select Register -------- */
#define AIC_SSR_INTSEL_Pos                    _U_(0)                                               /**< (AIC_SSR) Interrupt Line Selection Position */
#define AIC_SSR_INTSEL_Msk                    (_U_(0x7F) << AIC_SSR_INTSEL_Pos)                    /**< (AIC_SSR) Interrupt Line Selection Mask */
#define AIC_SSR_INTSEL(value)                 (AIC_SSR_INTSEL_Msk & ((value) << AIC_SSR_INTSEL_Pos))
#define AIC_SSR_Msk                           _U_(0x0000007F)                                      /**< (AIC_SSR) Register Mask  */


/* -------- AIC_SMR : (AIC Offset: 0x04) (R/W 32) Source Mode Register -------- */
#define AIC_SMR_PRIORITY_Pos                  _U_(0)                                               /**< (AIC_SMR) Priority Level Position */
#define AIC_SMR_PRIORITY_Msk                  (_U_(0x7) << AIC_SMR_PRIORITY_Pos)                   /**< (AIC_SMR) Priority Level Mask */
#define AIC_SMR_PRIORITY(value)               (AIC_SMR_PRIORITY_Msk & ((value) << AIC_SMR_PRIORITY_Pos))
#define   AIC_SMR_PRIORITY_MINIMUM_Val        _U_(0x0)                                             /**< (AIC_SMR) Minimum priority  */
#define   AIC_SMR_PRIORITY_VERY_LOW_Val       _U_(0x1)                                             /**< (AIC_SMR) Very low priority  */
#define   AIC_SMR_PRIORITY_LOW_Val            _U_(0x2)                                             /**< (AIC_SMR) Low priority  */
#define   AIC_SMR_PRIORITY_MEDIUM_LOW_Val     _U_(0x3)                                             /**< (AIC_SMR) Medium priority  */
#define   AIC_SMR_PRIORITY_MEDIUM_HIGH_Val    _U_(0x4)                                             /**< (AIC_SMR) Medium-high priority  */
#define   AIC_SMR_PRIORITY_HIGH_Val           _U_(0x5)                                             /**< (AIC_SMR) High priority  */
#define   AIC_SMR_PRIORITY_VERY_HIGH_Val      _U_(0x6)                                             /**< (AIC_SMR) Very high priority  */
#define   AIC_SMR_PRIORITY_MAXIMUM_Val        _U_(0x7)                                             /**< (AIC_SMR) Maximum priority  */
#define AIC_SMR_PRIORITY_MINIMUM              (AIC_SMR_PRIORITY_MINIMUM_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Minimum priority Position  */
#define AIC_SMR_PRIORITY_VERY_LOW             (AIC_SMR_PRIORITY_VERY_LOW_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Very low priority Position  */
#define AIC_SMR_PRIORITY_LOW                  (AIC_SMR_PRIORITY_LOW_Val << AIC_SMR_PRIORITY_Pos)   /**< (AIC_SMR) Low priority Position  */
#define AIC_SMR_PRIORITY_MEDIUM_LOW           (AIC_SMR_PRIORITY_MEDIUM_LOW_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Medium priority Position  */
#define AIC_SMR_PRIORITY_MEDIUM_HIGH          (AIC_SMR_PRIORITY_MEDIUM_HIGH_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Medium-high priority Position  */
#define AIC_SMR_PRIORITY_HIGH                 (AIC_SMR_PRIORITY_HIGH_Val << AIC_SMR_PRIORITY_Pos)  /**< (AIC_SMR) High priority Position  */
#define AIC_SMR_PRIORITY_VERY_HIGH            (AIC_SMR_PRIORITY_VERY_HIGH_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Very high priority Position  */
#define AIC_SMR_PRIORITY_MAXIMUM              (AIC_SMR_PRIORITY_MAXIMUM_Val << AIC_SMR_PRIORITY_Pos) /**< (AIC_SMR) Maximum priority Position  */
#define AIC_SMR_SRCTYPE_Pos                   _U_(5)                                               /**< (AIC_SMR) Interrupt Source Type Position */
#define AIC_SMR_SRCTYPE_Msk                   (_U_(0x3) << AIC_SMR_SRCTYPE_Pos)                    /**< (AIC_SMR) Interrupt Source Type Mask */
#define AIC_SMR_SRCTYPE(value)                (AIC_SMR_SRCTYPE_Msk & ((value) << AIC_SMR_SRCTYPE_Pos))
#define   AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val _U_(0x0)                                             /**< (AIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source  */
#define   AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val _U_(0x1)                                             /**< (AIC_SMR) Negative-edge triggered for external source  */
#define   AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val  _U_(0x2)                                             /**< (AIC_SMR) High-level sensitive for internal source. High-level sensitive for external source  */
#define   AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val _U_(0x3)                                             /**< (AIC_SMR) Positive-edge triggered for external source  */
#define AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE   (AIC_SMR_SRCTYPE_INT_LEVEL_SENSITIVE_Val << AIC_SMR_SRCTYPE_Pos) /**< (AIC_SMR) High-level sensitive for internal source. Low-level sensitive for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE     (AIC_SMR_SRCTYPE_EXT_NEGATIVE_EDGE_Val << AIC_SMR_SRCTYPE_Pos) /**< (AIC_SMR) Negative-edge triggered for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL        (AIC_SMR_SRCTYPE_EXT_HIGH_LEVEL_Val << AIC_SMR_SRCTYPE_Pos) /**< (AIC_SMR) High-level sensitive for internal source. High-level sensitive for external source Position  */
#define AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE     (AIC_SMR_SRCTYPE_EXT_POSITIVE_EDGE_Val << AIC_SMR_SRCTYPE_Pos) /**< (AIC_SMR) Positive-edge triggered for external source Position  */
#define AIC_SMR_Msk                           _U_(0x00000067)                                      /**< (AIC_SMR) Register Mask  */


/* -------- AIC_SVR : (AIC Offset: 0x08) (R/W 32) Source Vector Register -------- */
#define AIC_SVR_VECTOR_Pos                    _U_(0)                                               /**< (AIC_SVR) Source Vector Position */
#define AIC_SVR_VECTOR_Msk                    (_U_(0xFFFFFFFF) << AIC_SVR_VECTOR_Pos)              /**< (AIC_SVR) Source Vector Mask */
#define AIC_SVR_VECTOR(value)                 (AIC_SVR_VECTOR_Msk & ((value) << AIC_SVR_VECTOR_Pos))
#define AIC_SVR_Msk                           _U_(0xFFFFFFFF)                                      /**< (AIC_SVR) Register Mask  */


/* -------- AIC_IVR : (AIC Offset: 0x10) ( R/ 32) Interrupt Vector Register -------- */
#define AIC_IVR_IRQV_Pos                      _U_(0)                                               /**< (AIC_IVR) Interrupt Vector Register Position */
#define AIC_IVR_IRQV_Msk                      (_U_(0xFFFFFFFF) << AIC_IVR_IRQV_Pos)                /**< (AIC_IVR) Interrupt Vector Register Mask */
#define AIC_IVR_IRQV(value)                   (AIC_IVR_IRQV_Msk & ((value) << AIC_IVR_IRQV_Pos))  
#define AIC_IVR_Msk                           _U_(0xFFFFFFFF)                                      /**< (AIC_IVR) Register Mask  */


/* -------- AIC_FVR : (AIC Offset: 0x14) ( R/ 32) FIQ Vector Register -------- */
#define AIC_FVR_FIQV_Pos                      _U_(0)                                               /**< (AIC_FVR) FIQ Vector Register Position */
#define AIC_FVR_FIQV_Msk                      (_U_(0xFFFFFFFF) << AIC_FVR_FIQV_Pos)                /**< (AIC_FVR) FIQ Vector Register Mask */
#define AIC_FVR_FIQV(value)                   (AIC_FVR_FIQV_Msk & ((value) << AIC_FVR_FIQV_Pos))  
#define AIC_FVR_Msk                           _U_(0xFFFFFFFF)                                      /**< (AIC_FVR) Register Mask  */


/* -------- AIC_ISR : (AIC Offset: 0x18) ( R/ 32) Interrupt Status Register -------- */
#define AIC_ISR_IRQID_Pos                     _U_(0)                                               /**< (AIC_ISR) Current Interrupt Identifier Position */
#define AIC_ISR_IRQID_Msk                     (_U_(0x7F) << AIC_ISR_IRQID_Pos)                     /**< (AIC_ISR) Current Interrupt Identifier Mask */
#define AIC_ISR_IRQID(value)                  (AIC_ISR_IRQID_Msk & ((value) << AIC_ISR_IRQID_Pos))
#define AIC_ISR_Msk                           _U_(0x0000007F)                                      /**< (AIC_ISR) Register Mask  */


/* -------- AIC_IPR0 : (AIC Offset: 0x20) ( R/ 32) Interrupt Pending Register 0 -------- */
#define AIC_IPR0_FIQ_Pos                      _U_(0)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_FIQ_Msk                      (_U_(0x1) << AIC_IPR0_FIQ_Pos)                       /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_FIQ(value)                   (AIC_IPR0_FIQ_Msk & ((value) << AIC_IPR0_FIQ_Pos))  
#define AIC_IPR0_PID1_Pos                     _U_(1)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID1_Msk                     (_U_(0x1) << AIC_IPR0_PID1_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID1(value)                  (AIC_IPR0_PID1_Msk & ((value) << AIC_IPR0_PID1_Pos))
#define AIC_IPR0_PID2_Pos                     _U_(2)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID2_Msk                     (_U_(0x1) << AIC_IPR0_PID2_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID2(value)                  (AIC_IPR0_PID2_Msk & ((value) << AIC_IPR0_PID2_Pos))
#define AIC_IPR0_PID3_Pos                     _U_(3)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID3_Msk                     (_U_(0x1) << AIC_IPR0_PID3_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID3(value)                  (AIC_IPR0_PID3_Msk & ((value) << AIC_IPR0_PID3_Pos))
#define AIC_IPR0_PID4_Pos                     _U_(4)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID4_Msk                     (_U_(0x1) << AIC_IPR0_PID4_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID4(value)                  (AIC_IPR0_PID4_Msk & ((value) << AIC_IPR0_PID4_Pos))
#define AIC_IPR0_PID5_Pos                     _U_(5)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID5_Msk                     (_U_(0x1) << AIC_IPR0_PID5_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID5(value)                  (AIC_IPR0_PID5_Msk & ((value) << AIC_IPR0_PID5_Pos))
#define AIC_IPR0_PID6_Pos                     _U_(6)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID6_Msk                     (_U_(0x1) << AIC_IPR0_PID6_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID6(value)                  (AIC_IPR0_PID6_Msk & ((value) << AIC_IPR0_PID6_Pos))
#define AIC_IPR0_PID7_Pos                     _U_(7)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID7_Msk                     (_U_(0x1) << AIC_IPR0_PID7_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID7(value)                  (AIC_IPR0_PID7_Msk & ((value) << AIC_IPR0_PID7_Pos))
#define AIC_IPR0_PID8_Pos                     _U_(8)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID8_Msk                     (_U_(0x1) << AIC_IPR0_PID8_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID8(value)                  (AIC_IPR0_PID8_Msk & ((value) << AIC_IPR0_PID8_Pos))
#define AIC_IPR0_PID9_Pos                     _U_(9)                                               /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID9_Msk                     (_U_(0x1) << AIC_IPR0_PID9_Pos)                      /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID9(value)                  (AIC_IPR0_PID9_Msk & ((value) << AIC_IPR0_PID9_Pos))
#define AIC_IPR0_PID10_Pos                    _U_(10)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID10_Msk                    (_U_(0x1) << AIC_IPR0_PID10_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID10(value)                 (AIC_IPR0_PID10_Msk & ((value) << AIC_IPR0_PID10_Pos))
#define AIC_IPR0_PID11_Pos                    _U_(11)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID11_Msk                    (_U_(0x1) << AIC_IPR0_PID11_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID11(value)                 (AIC_IPR0_PID11_Msk & ((value) << AIC_IPR0_PID11_Pos))
#define AIC_IPR0_PID12_Pos                    _U_(12)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID12_Msk                    (_U_(0x1) << AIC_IPR0_PID12_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID12(value)                 (AIC_IPR0_PID12_Msk & ((value) << AIC_IPR0_PID12_Pos))
#define AIC_IPR0_PID13_Pos                    _U_(13)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID13_Msk                    (_U_(0x1) << AIC_IPR0_PID13_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID13(value)                 (AIC_IPR0_PID13_Msk & ((value) << AIC_IPR0_PID13_Pos))
#define AIC_IPR0_PID14_Pos                    _U_(14)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID14_Msk                    (_U_(0x1) << AIC_IPR0_PID14_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID14(value)                 (AIC_IPR0_PID14_Msk & ((value) << AIC_IPR0_PID14_Pos))
#define AIC_IPR0_PID15_Pos                    _U_(15)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID15_Msk                    (_U_(0x1) << AIC_IPR0_PID15_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID15(value)                 (AIC_IPR0_PID15_Msk & ((value) << AIC_IPR0_PID15_Pos))
#define AIC_IPR0_PID16_Pos                    _U_(16)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID16_Msk                    (_U_(0x1) << AIC_IPR0_PID16_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID16(value)                 (AIC_IPR0_PID16_Msk & ((value) << AIC_IPR0_PID16_Pos))
#define AIC_IPR0_PID17_Pos                    _U_(17)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID17_Msk                    (_U_(0x1) << AIC_IPR0_PID17_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID17(value)                 (AIC_IPR0_PID17_Msk & ((value) << AIC_IPR0_PID17_Pos))
#define AIC_IPR0_PID18_Pos                    _U_(18)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID18_Msk                    (_U_(0x1) << AIC_IPR0_PID18_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID18(value)                 (AIC_IPR0_PID18_Msk & ((value) << AIC_IPR0_PID18_Pos))
#define AIC_IPR0_PID19_Pos                    _U_(19)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID19_Msk                    (_U_(0x1) << AIC_IPR0_PID19_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID19(value)                 (AIC_IPR0_PID19_Msk & ((value) << AIC_IPR0_PID19_Pos))
#define AIC_IPR0_PID20_Pos                    _U_(20)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID20_Msk                    (_U_(0x1) << AIC_IPR0_PID20_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID20(value)                 (AIC_IPR0_PID20_Msk & ((value) << AIC_IPR0_PID20_Pos))
#define AIC_IPR0_PID21_Pos                    _U_(21)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID21_Msk                    (_U_(0x1) << AIC_IPR0_PID21_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID21(value)                 (AIC_IPR0_PID21_Msk & ((value) << AIC_IPR0_PID21_Pos))
#define AIC_IPR0_PID22_Pos                    _U_(22)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID22_Msk                    (_U_(0x1) << AIC_IPR0_PID22_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID22(value)                 (AIC_IPR0_PID22_Msk & ((value) << AIC_IPR0_PID22_Pos))
#define AIC_IPR0_PID23_Pos                    _U_(23)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID23_Msk                    (_U_(0x1) << AIC_IPR0_PID23_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID23(value)                 (AIC_IPR0_PID23_Msk & ((value) << AIC_IPR0_PID23_Pos))
#define AIC_IPR0_PID24_Pos                    _U_(24)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID24_Msk                    (_U_(0x1) << AIC_IPR0_PID24_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID24(value)                 (AIC_IPR0_PID24_Msk & ((value) << AIC_IPR0_PID24_Pos))
#define AIC_IPR0_PID25_Pos                    _U_(25)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID25_Msk                    (_U_(0x1) << AIC_IPR0_PID25_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID25(value)                 (AIC_IPR0_PID25_Msk & ((value) << AIC_IPR0_PID25_Pos))
#define AIC_IPR0_PID26_Pos                    _U_(26)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID26_Msk                    (_U_(0x1) << AIC_IPR0_PID26_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID26(value)                 (AIC_IPR0_PID26_Msk & ((value) << AIC_IPR0_PID26_Pos))
#define AIC_IPR0_PID27_Pos                    _U_(27)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID27_Msk                    (_U_(0x1) << AIC_IPR0_PID27_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID27(value)                 (AIC_IPR0_PID27_Msk & ((value) << AIC_IPR0_PID27_Pos))
#define AIC_IPR0_PID28_Pos                    _U_(28)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID28_Msk                    (_U_(0x1) << AIC_IPR0_PID28_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID28(value)                 (AIC_IPR0_PID28_Msk & ((value) << AIC_IPR0_PID28_Pos))
#define AIC_IPR0_PID29_Pos                    _U_(29)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID29_Msk                    (_U_(0x1) << AIC_IPR0_PID29_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID29(value)                 (AIC_IPR0_PID29_Msk & ((value) << AIC_IPR0_PID29_Pos))
#define AIC_IPR0_PID30_Pos                    _U_(30)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID30_Msk                    (_U_(0x1) << AIC_IPR0_PID30_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID30(value)                 (AIC_IPR0_PID30_Msk & ((value) << AIC_IPR0_PID30_Pos))
#define AIC_IPR0_PID31_Pos                    _U_(31)                                              /**< (AIC_IPR0) Interrupt Pending Position */
#define AIC_IPR0_PID31_Msk                    (_U_(0x1) << AIC_IPR0_PID31_Pos)                     /**< (AIC_IPR0) Interrupt Pending Mask */
#define AIC_IPR0_PID31(value)                 (AIC_IPR0_PID31_Msk & ((value) << AIC_IPR0_PID31_Pos))
#define AIC_IPR0_Msk                          _U_(0xFFFFFFFF)                                      /**< (AIC_IPR0) Register Mask  */

