virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/component/aic.h
#define AIC_IPR0_PID_Pos                      _U_(1)                                               /**< (AIC_IPR0 Position) Interrupt Pending */
#define AIC_IPR0_PID_Msk                      (_U_(0x7FFFFFFF) << AIC_IPR0_PID_Pos)                /**< (AIC_IPR0 Mask) PID */
#define AIC_IPR0_PID(value)                   (AIC_IPR0_PID_Msk & ((value) << AIC_IPR0_PID_Pos))   

/* -------- AIC_IPR1 : (AIC Offset: 0x24) ( R/ 32) Interrupt Pending Register 1 -------- */
#define AIC_IPR1_PID32_Pos                    _U_(0)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID32_Msk                    (_U_(0x1) << AIC_IPR1_PID32_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID32(value)                 (AIC_IPR1_PID32_Msk & ((value) << AIC_IPR1_PID32_Pos))
#define AIC_IPR1_PID33_Pos                    _U_(1)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID33_Msk                    (_U_(0x1) << AIC_IPR1_PID33_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID33(value)                 (AIC_IPR1_PID33_Msk & ((value) << AIC_IPR1_PID33_Pos))
#define AIC_IPR1_PID34_Pos                    _U_(2)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID34_Msk                    (_U_(0x1) << AIC_IPR1_PID34_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID34(value)                 (AIC_IPR1_PID34_Msk & ((value) << AIC_IPR1_PID34_Pos))
#define AIC_IPR1_PID35_Pos                    _U_(3)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID35_Msk                    (_U_(0x1) << AIC_IPR1_PID35_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID35(value)                 (AIC_IPR1_PID35_Msk & ((value) << AIC_IPR1_PID35_Pos))
#define AIC_IPR1_PID36_Pos                    _U_(4)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID36_Msk                    (_U_(0x1) << AIC_IPR1_PID36_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID36(value)                 (AIC_IPR1_PID36_Msk & ((value) << AIC_IPR1_PID36_Pos))
#define AIC_IPR1_PID37_Pos                    _U_(5)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID37_Msk                    (_U_(0x1) << AIC_IPR1_PID37_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID37(value)                 (AIC_IPR1_PID37_Msk & ((value) << AIC_IPR1_PID37_Pos))
#define AIC_IPR1_PID38_Pos                    _U_(6)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID38_Msk                    (_U_(0x1) << AIC_IPR1_PID38_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID38(value)                 (AIC_IPR1_PID38_Msk & ((value) << AIC_IPR1_PID38_Pos))
#define AIC_IPR1_PID39_Pos                    _U_(7)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID39_Msk                    (_U_(0x1) << AIC_IPR1_PID39_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID39(value)                 (AIC_IPR1_PID39_Msk & ((value) << AIC_IPR1_PID39_Pos))
#define AIC_IPR1_PID40_Pos                    _U_(8)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID40_Msk                    (_U_(0x1) << AIC_IPR1_PID40_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID40(value)                 (AIC_IPR1_PID40_Msk & ((value) << AIC_IPR1_PID40_Pos))
#define AIC_IPR1_PID41_Pos                    _U_(9)                                               /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID41_Msk                    (_U_(0x1) << AIC_IPR1_PID41_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID41(value)                 (AIC_IPR1_PID41_Msk & ((value) << AIC_IPR1_PID41_Pos))
#define AIC_IPR1_PID42_Pos                    _U_(10)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID42_Msk                    (_U_(0x1) << AIC_IPR1_PID42_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID42(value)                 (AIC_IPR1_PID42_Msk & ((value) << AIC_IPR1_PID42_Pos))
#define AIC_IPR1_PID43_Pos                    _U_(11)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID43_Msk                    (_U_(0x1) << AIC_IPR1_PID43_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID43(value)                 (AIC_IPR1_PID43_Msk & ((value) << AIC_IPR1_PID43_Pos))
#define AIC_IPR1_PID44_Pos                    _U_(12)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID44_Msk                    (_U_(0x1) << AIC_IPR1_PID44_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID44(value)                 (AIC_IPR1_PID44_Msk & ((value) << AIC_IPR1_PID44_Pos))
#define AIC_IPR1_PID45_Pos                    _U_(13)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID45_Msk                    (_U_(0x1) << AIC_IPR1_PID45_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID45(value)                 (AIC_IPR1_PID45_Msk & ((value) << AIC_IPR1_PID45_Pos))
#define AIC_IPR1_PID46_Pos                    _U_(14)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID46_Msk                    (_U_(0x1) << AIC_IPR1_PID46_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID46(value)                 (AIC_IPR1_PID46_Msk & ((value) << AIC_IPR1_PID46_Pos))
#define AIC_IPR1_PID47_Pos                    _U_(15)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID47_Msk                    (_U_(0x1) << AIC_IPR1_PID47_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID47(value)                 (AIC_IPR1_PID47_Msk & ((value) << AIC_IPR1_PID47_Pos))
#define AIC_IPR1_PID48_Pos                    _U_(16)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID48_Msk                    (_U_(0x1) << AIC_IPR1_PID48_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID48(value)                 (AIC_IPR1_PID48_Msk & ((value) << AIC_IPR1_PID48_Pos))
#define AIC_IPR1_PID49_Pos                    _U_(17)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID49_Msk                    (_U_(0x1) << AIC_IPR1_PID49_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID49(value)                 (AIC_IPR1_PID49_Msk & ((value) << AIC_IPR1_PID49_Pos))
#define AIC_IPR1_PID50_Pos                    _U_(18)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID50_Msk                    (_U_(0x1) << AIC_IPR1_PID50_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID50(value)                 (AIC_IPR1_PID50_Msk & ((value) << AIC_IPR1_PID50_Pos))
#define AIC_IPR1_PID51_Pos                    _U_(19)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID51_Msk                    (_U_(0x1) << AIC_IPR1_PID51_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID51(value)                 (AIC_IPR1_PID51_Msk & ((value) << AIC_IPR1_PID51_Pos))
#define AIC_IPR1_PID52_Pos                    _U_(20)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID52_Msk                    (_U_(0x1) << AIC_IPR1_PID52_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID52(value)                 (AIC_IPR1_PID52_Msk & ((value) << AIC_IPR1_PID52_Pos))
#define AIC_IPR1_PID53_Pos                    _U_(21)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID53_Msk                    (_U_(0x1) << AIC_IPR1_PID53_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID53(value)                 (AIC_IPR1_PID53_Msk & ((value) << AIC_IPR1_PID53_Pos))
#define AIC_IPR1_PID54_Pos                    _U_(22)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID54_Msk                    (_U_(0x1) << AIC_IPR1_PID54_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID54(value)                 (AIC_IPR1_PID54_Msk & ((value) << AIC_IPR1_PID54_Pos))
#define AIC_IPR1_PID55_Pos                    _U_(23)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID55_Msk                    (_U_(0x1) << AIC_IPR1_PID55_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID55(value)                 (AIC_IPR1_PID55_Msk & ((value) << AIC_IPR1_PID55_Pos))
#define AIC_IPR1_PID56_Pos                    _U_(24)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID56_Msk                    (_U_(0x1) << AIC_IPR1_PID56_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID56(value)                 (AIC_IPR1_PID56_Msk & ((value) << AIC_IPR1_PID56_Pos))
#define AIC_IPR1_PID57_Pos                    _U_(25)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID57_Msk                    (_U_(0x1) << AIC_IPR1_PID57_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID57(value)                 (AIC_IPR1_PID57_Msk & ((value) << AIC_IPR1_PID57_Pos))
#define AIC_IPR1_PID58_Pos                    _U_(26)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID58_Msk                    (_U_(0x1) << AIC_IPR1_PID58_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID58(value)                 (AIC_IPR1_PID58_Msk & ((value) << AIC_IPR1_PID58_Pos))
#define AIC_IPR1_PID59_Pos                    _U_(27)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID59_Msk                    (_U_(0x1) << AIC_IPR1_PID59_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID59(value)                 (AIC_IPR1_PID59_Msk & ((value) << AIC_IPR1_PID59_Pos))
#define AIC_IPR1_PID60_Pos                    _U_(28)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID60_Msk                    (_U_(0x1) << AIC_IPR1_PID60_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID60(value)                 (AIC_IPR1_PID60_Msk & ((value) << AIC_IPR1_PID60_Pos))
#define AIC_IPR1_PID61_Pos                    _U_(29)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID61_Msk                    (_U_(0x1) << AIC_IPR1_PID61_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID61(value)                 (AIC_IPR1_PID61_Msk & ((value) << AIC_IPR1_PID61_Pos))
#define AIC_IPR1_PID62_Pos                    _U_(30)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID62_Msk                    (_U_(0x1) << AIC_IPR1_PID62_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID62(value)                 (AIC_IPR1_PID62_Msk & ((value) << AIC_IPR1_PID62_Pos))
#define AIC_IPR1_PID63_Pos                    _U_(31)                                              /**< (AIC_IPR1) Interrupt Pending Position */
#define AIC_IPR1_PID63_Msk                    (_U_(0x1) << AIC_IPR1_PID63_Pos)                     /**< (AIC_IPR1) Interrupt Pending Mask */
#define AIC_IPR1_PID63(value)                 (AIC_IPR1_PID63_Msk & ((value) << AIC_IPR1_PID63_Pos))
#define AIC_IPR1_Msk                          _U_(0xFFFFFFFF)                                      /**< (AIC_IPR1) Register Mask  */

#define AIC_IPR1_PID_Pos                      _U_(0)                                               /**< (AIC_IPR1 Position) Interrupt Pending */
#define AIC_IPR1_PID_Msk                      (_U_(0xFFFFFFFF) << AIC_IPR1_PID_Pos)                /**< (AIC_IPR1 Mask) PID */
#define AIC_IPR1_PID(value)                   (AIC_IPR1_PID_Msk & ((value) << AIC_IPR1_PID_Pos))   

