virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CD1G_DFP/component/aic.h
/* -------- AIC_IPR3 : (AIC Offset: 0x2C) ( R/ 32) Interrupt Pending Register 3 -------- */
#define AIC_IPR3_PID96_Pos                    _U_(0)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID96_Msk                    (_U_(0x1) << AIC_IPR3_PID96_Pos)                     /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID96(value)                 (AIC_IPR3_PID96_Msk & ((value) << AIC_IPR3_PID96_Pos))
#define AIC_IPR3_PID97_Pos                    _U_(1)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID97_Msk                    (_U_(0x1) << AIC_IPR3_PID97_Pos)                     /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID97(value)                 (AIC_IPR3_PID97_Msk & ((value) << AIC_IPR3_PID97_Pos))
#define AIC_IPR3_PID98_Pos                    _U_(2)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID98_Msk                    (_U_(0x1) << AIC_IPR3_PID98_Pos)                     /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID98(value)                 (AIC_IPR3_PID98_Msk & ((value) << AIC_IPR3_PID98_Pos))
#define AIC_IPR3_PID99_Pos                    _U_(3)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID99_Msk                    (_U_(0x1) << AIC_IPR3_PID99_Pos)                     /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID99(value)                 (AIC_IPR3_PID99_Msk & ((value) << AIC_IPR3_PID99_Pos))
#define AIC_IPR3_PID100_Pos                   _U_(4)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID100_Msk                   (_U_(0x1) << AIC_IPR3_PID100_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID100(value)                (AIC_IPR3_PID100_Msk & ((value) << AIC_IPR3_PID100_Pos))
#define AIC_IPR3_PID101_Pos                   _U_(5)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID101_Msk                   (_U_(0x1) << AIC_IPR3_PID101_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID101(value)                (AIC_IPR3_PID101_Msk & ((value) << AIC_IPR3_PID101_Pos))
#define AIC_IPR3_PID102_Pos                   _U_(6)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID102_Msk                   (_U_(0x1) << AIC_IPR3_PID102_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID102(value)                (AIC_IPR3_PID102_Msk & ((value) << AIC_IPR3_PID102_Pos))
#define AIC_IPR3_PID103_Pos                   _U_(7)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID103_Msk                   (_U_(0x1) << AIC_IPR3_PID103_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID103(value)                (AIC_IPR3_PID103_Msk & ((value) << AIC_IPR3_PID103_Pos))
#define AIC_IPR3_PID104_Pos                   _U_(8)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID104_Msk                   (_U_(0x1) << AIC_IPR3_PID104_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID104(value)                (AIC_IPR3_PID104_Msk & ((value) << AIC_IPR3_PID104_Pos))
#define AIC_IPR3_PID105_Pos                   _U_(9)                                               /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID105_Msk                   (_U_(0x1) << AIC_IPR3_PID105_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID105(value)                (AIC_IPR3_PID105_Msk & ((value) << AIC_IPR3_PID105_Pos))
#define AIC_IPR3_PID106_Pos                   _U_(10)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID106_Msk                   (_U_(0x1) << AIC_IPR3_PID106_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID106(value)                (AIC_IPR3_PID106_Msk & ((value) << AIC_IPR3_PID106_Pos))
#define AIC_IPR3_PID107_Pos                   _U_(11)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID107_Msk                   (_U_(0x1) << AIC_IPR3_PID107_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID107(value)                (AIC_IPR3_PID107_Msk & ((value) << AIC_IPR3_PID107_Pos))
#define AIC_IPR3_PID108_Pos                   _U_(12)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID108_Msk                   (_U_(0x1) << AIC_IPR3_PID108_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID108(value)                (AIC_IPR3_PID108_Msk & ((value) << AIC_IPR3_PID108_Pos))
#define AIC_IPR3_PID109_Pos                   _U_(13)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID109_Msk                   (_U_(0x1) << AIC_IPR3_PID109_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID109(value)                (AIC_IPR3_PID109_Msk & ((value) << AIC_IPR3_PID109_Pos))
#define AIC_IPR3_PID110_Pos                   _U_(14)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID110_Msk                   (_U_(0x1) << AIC_IPR3_PID110_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID110(value)                (AIC_IPR3_PID110_Msk & ((value) << AIC_IPR3_PID110_Pos))
#define AIC_IPR3_PID111_Pos                   _U_(15)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID111_Msk                   (_U_(0x1) << AIC_IPR3_PID111_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID111(value)                (AIC_IPR3_PID111_Msk & ((value) << AIC_IPR3_PID111_Pos))
#define AIC_IPR3_PID112_Pos                   _U_(16)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID112_Msk                   (_U_(0x1) << AIC_IPR3_PID112_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID112(value)                (AIC_IPR3_PID112_Msk & ((value) << AIC_IPR3_PID112_Pos))
#define AIC_IPR3_PID113_Pos                   _U_(17)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID113_Msk                   (_U_(0x1) << AIC_IPR3_PID113_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID113(value)                (AIC_IPR3_PID113_Msk & ((value) << AIC_IPR3_PID113_Pos))
#define AIC_IPR3_PID114_Pos                   _U_(18)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID114_Msk                   (_U_(0x1) << AIC_IPR3_PID114_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID114(value)                (AIC_IPR3_PID114_Msk & ((value) << AIC_IPR3_PID114_Pos))
#define AIC_IPR3_PID115_Pos                   _U_(19)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID115_Msk                   (_U_(0x1) << AIC_IPR3_PID115_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID115(value)                (AIC_IPR3_PID115_Msk & ((value) << AIC_IPR3_PID115_Pos))
#define AIC_IPR3_PID116_Pos                   _U_(20)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID116_Msk                   (_U_(0x1) << AIC_IPR3_PID116_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID116(value)                (AIC_IPR3_PID116_Msk & ((value) << AIC_IPR3_PID116_Pos))
#define AIC_IPR3_PID117_Pos                   _U_(21)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID117_Msk                   (_U_(0x1) << AIC_IPR3_PID117_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID117(value)                (AIC_IPR3_PID117_Msk & ((value) << AIC_IPR3_PID117_Pos))
#define AIC_IPR3_PID118_Pos                   _U_(22)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID118_Msk                   (_U_(0x1) << AIC_IPR3_PID118_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID118(value)                (AIC_IPR3_PID118_Msk & ((value) << AIC_IPR3_PID118_Pos))
#define AIC_IPR3_PID119_Pos                   _U_(23)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID119_Msk                   (_U_(0x1) << AIC_IPR3_PID119_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID119(value)                (AIC_IPR3_PID119_Msk & ((value) << AIC_IPR3_PID119_Pos))
#define AIC_IPR3_PID120_Pos                   _U_(24)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID120_Msk                   (_U_(0x1) << AIC_IPR3_PID120_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID120(value)                (AIC_IPR3_PID120_Msk & ((value) << AIC_IPR3_PID120_Pos))
#define AIC_IPR3_PID121_Pos                   _U_(25)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID121_Msk                   (_U_(0x1) << AIC_IPR3_PID121_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID121(value)                (AIC_IPR3_PID121_Msk & ((value) << AIC_IPR3_PID121_Pos))
#define AIC_IPR3_PID122_Pos                   _U_(26)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID122_Msk                   (_U_(0x1) << AIC_IPR3_PID122_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID122(value)                (AIC_IPR3_PID122_Msk & ((value) << AIC_IPR3_PID122_Pos))
#define AIC_IPR3_PID123_Pos                   _U_(27)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID123_Msk                   (_U_(0x1) << AIC_IPR3_PID123_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID123(value)                (AIC_IPR3_PID123_Msk & ((value) << AIC_IPR3_PID123_Pos))
#define AIC_IPR3_PID124_Pos                   _U_(28)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID124_Msk                   (_U_(0x1) << AIC_IPR3_PID124_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID124(value)                (AIC_IPR3_PID124_Msk & ((value) << AIC_IPR3_PID124_Pos))
#define AIC_IPR3_PID125_Pos                   _U_(29)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID125_Msk                   (_U_(0x1) << AIC_IPR3_PID125_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID125(value)                (AIC_IPR3_PID125_Msk & ((value) << AIC_IPR3_PID125_Pos))
#define AIC_IPR3_PID126_Pos                   _U_(30)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID126_Msk                   (_U_(0x1) << AIC_IPR3_PID126_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID126(value)                (AIC_IPR3_PID126_Msk & ((value) << AIC_IPR3_PID126_Pos))
#define AIC_IPR3_PID127_Pos                   _U_(31)                                              /**< (AIC_IPR3) Interrupt Pending Position */
#define AIC_IPR3_PID127_Msk                   (_U_(0x1) << AIC_IPR3_PID127_Pos)                    /**< (AIC_IPR3) Interrupt Pending Mask */
#define AIC_IPR3_PID127(value)                (AIC_IPR3_PID127_Msk & ((value) << AIC_IPR3_PID127_Pos))
#define AIC_IPR3_Msk                          _U_(0xFFFFFFFF)                                      /**< (AIC_IPR3) Register Mask  */

#define AIC_IPR3_PID_Pos                      _U_(0)                                               /**< (AIC_IPR3 Position) Interrupt Pending */
#define AIC_IPR3_PID_Msk                      (_U_(0xFFFFFFFF) << AIC_IPR3_PID_Pos)                /**< (AIC_IPR3 Mask) PID */
#define AIC_IPR3_PID(value)                   (AIC_IPR3_PID_Msk & ((value) << AIC_IPR3_PID_Pos))   

/* -------- AIC_IMR : (AIC Offset: 0x30) ( R/ 32) Interrupt Mask Register -------- */
#define AIC_IMR_INTM_Pos                      _U_(0)                                               /**< (AIC_IMR) Interrupt Mask Position */
#define AIC_IMR_INTM_Msk                      (_U_(0x1) << AIC_IMR_INTM_Pos)                       /**< (AIC_IMR) Interrupt Mask Mask */
#define AIC_IMR_INTM(value)                   (AIC_IMR_INTM_Msk & ((value) << AIC_IMR_INTM_Pos))  
#define AIC_IMR_Msk                           _U_(0x00000001)                                      /**< (AIC_IMR) Register Mask  */


/* -------- AIC_CISR : (AIC Offset: 0x34) ( R/ 32) Core Interrupt Status Register -------- */
#define AIC_CISR_NFIQ_Pos                     _U_(0)                                               /**< (AIC_CISR) NFIQ Status Position */
#define AIC_CISR_NFIQ_Msk                     (_U_(0x1) << AIC_CISR_NFIQ_Pos)                      /**< (AIC_CISR) NFIQ Status Mask */
#define AIC_CISR_NFIQ(value)                  (AIC_CISR_NFIQ_Msk & ((value) << AIC_CISR_NFIQ_Pos))
#define AIC_CISR_NIRQ_Pos                     _U_(1)                                               /**< (AIC_CISR) NIRQ Status Position */
#define AIC_CISR_NIRQ_Msk                     (_U_(0x1) << AIC_CISR_NIRQ_Pos)                      /**< (AIC_CISR) NIRQ Status Mask */
#define AIC_CISR_NIRQ(value)                  (AIC_CISR_NIRQ_Msk & ((value) << AIC_CISR_NIRQ_Pos))
#define AIC_CISR_Msk                          _U_(0x00000003)                                      /**< (AIC_CISR) Register Mask  */


